"""

if 条件语句1:
    if 条件语句2：
        执行语句
        执行语句
        执行语句
        ......
        else：
        执行语句
        执行语句
        执行语句
        ......

else:
    执行语句
    执行语句
    执行语句
    ......

"""
#记住缩进一一对应
print("=================================================================")
'''
记住缩进一一对应,从上往下执行，若有多个条件符合，则会执行符合的第一个。
if 条件语句一：
    执行语句
    执行语句
    执行语句
    ......
    
elif 条件语句二：
    执行语句
    执行语句
    ......
    
elif 条件语句三：
    执行语句
    执行语句
    执行语句
    ......
    
else :
    执行语句
    执行语句
    执行语句
    ......

'''
print("=================================================================")
