"""
for 变量 in 可迭代对象:
    # 循环体
    执行语句
"""
fruits = ["apple", "banana", "cherry"]
for fruit in fruits:
    print(f"我喜欢吃 {fruit}")

print("======================================")

"""
range(start, stop, step)    #for 变量 in range()函数
可以通过range函数来控制for循环的循环次数，不必像while循环那样定义变量来控制循环次数
"""

print("======================================")

for j in range(1,10):       #从1开始（包含1），到10结束（不包含10）
    print(j)
"""
输出： 1
      2
      3
      4
      5
      6
      7
      8
      9
"""

print("======================================")

i = 1
while i < 10:
    print(i)
    i += 1

"""
输出： 1
      2
      3
      4
      5
      6
      7
      8
      9
"""

print("======================================")

for i in range(1, 10, 2):   #从1开始（包含1），到10结束（不包含10），（步长为2）
    print(i)

"""
输出： 1
      3
      5
      7
      9
"""

print("======================================")

#计数器,求1到100的和.
Total = 0
for num in range(1, 101):
    Total += num
print("总和:", Total)  # 输出:"总和: 5050"
#对比 test022.py 中的计数器写法

print("======================================")
