"""
continue语句的作用：
    ● 跳过当前循环的剩余代码
    ● 直接进入下一次循环
    ● 请与test022.py中的 break 用法一起学
"""

print("===========================================")

for i in range(1, 10):
    if i == 5:
        continue            #到5时结束此次循环，并且直接进入下次循环
    print(i)

"""
输出结果:
        1
        2
        3
        4
        6
        7
        8
        9
"""

print("===========================================")

for i in range(1,10):
    if i == 5:
        break               #到5时结束循环，并且直接跳出循环体，不会进入下次循环
    print(i)

"""
输出结果:
        1
        2
        3
        4
"""

print("===========================================")
