# while 条件循环
"""
while 条件:  条件 true执行 false停止
    # 循环体
    执行语句
"""
print("===========================================")

a = int(input("输入a(a>0)的值： "))   # 提示用户输入 a 的值注意 a > 0

while a>0:                          # 当输入的a的值大于 0 时，执行循环
     print(a)                       # 打印 a 的值
     a = a - 1                      # 通过自减来避免死循环，当 a 的值不在大于 0 时循环结束
print("循环结束！")

"""
输出结果：a
        a-1
        a-2
        a-3
        a-4
        a-5
       ......
         3
         2
         1
        循环结束！
"""

print("===========================================")

